Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/sdmmc.h
/* -------- SDMMC_EISTR : (SDMMC Offset: 0x32) (R/W 16) Error Interrupt Status -------- */
#define SDMMC_EISTR_RESETVALUE                _UINT16_(0x00)                                       /*  (SDMMC_EISTR) Error Interrupt Status  Reset Value */

#define SDMMC_EISTR_CMDTEO_Pos                _UINT16_(0)                                          /* (SDMMC_EISTR) Command Timeout Error Position */
#define SDMMC_EISTR_CMDTEO_Msk                (_UINT16_(0x1) << SDMMC_EISTR_CMDTEO_Pos)            /* (SDMMC_EISTR) Command Timeout Error Mask */
#define SDMMC_EISTR_CMDTEO(value)             (SDMMC_EISTR_CMDTEO_Msk & (_UINT16_(value) << SDMMC_EISTR_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDMMC_EISTR register */
#define   SDMMC_EISTR_CMDTEO_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_CMDTEO_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) Timeout  */
#define SDMMC_EISTR_CMDTEO_NO                 (SDMMC_EISTR_CMDTEO_NO_Val << SDMMC_EISTR_CMDTEO_Pos) /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_CMDTEO_YES                (SDMMC_EISTR_CMDTEO_YES_Val << SDMMC_EISTR_CMDTEO_Pos) /* (SDMMC_EISTR) Timeout Position  */
#define SDMMC_EISTR_CMDCRC_Pos                _UINT16_(1)                                          /* (SDMMC_EISTR) Command CRC Error Position */
#define SDMMC_EISTR_CMDCRC_Msk                (_UINT16_(0x1) << SDMMC_EISTR_CMDCRC_Pos)            /* (SDMMC_EISTR) Command CRC Error Mask */
#define SDMMC_EISTR_CMDCRC(value)             (SDMMC_EISTR_CMDCRC_Msk & (_UINT16_(value) << SDMMC_EISTR_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDMMC_EISTR register */
#define   SDMMC_EISTR_CMDCRC_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_CMDCRC_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) CRC Error Generated  */
#define SDMMC_EISTR_CMDCRC_NO                 (SDMMC_EISTR_CMDCRC_NO_Val << SDMMC_EISTR_CMDCRC_Pos) /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_CMDCRC_YES                (SDMMC_EISTR_CMDCRC_YES_Val << SDMMC_EISTR_CMDCRC_Pos) /* (SDMMC_EISTR) CRC Error Generated Position  */
#define SDMMC_EISTR_CMDEND_Pos                _UINT16_(2)                                          /* (SDMMC_EISTR) Command End Bit Error Position */
#define SDMMC_EISTR_CMDEND_Msk                (_UINT16_(0x1) << SDMMC_EISTR_CMDEND_Pos)            /* (SDMMC_EISTR) Command End Bit Error Mask */
#define SDMMC_EISTR_CMDEND(value)             (SDMMC_EISTR_CMDEND_Msk & (_UINT16_(value) << SDMMC_EISTR_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDMMC_EISTR register */
#define   SDMMC_EISTR_CMDEND_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No error  */
#define   SDMMC_EISTR_CMDEND_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) End Bit Error Generated  */
#define SDMMC_EISTR_CMDEND_NO                 (SDMMC_EISTR_CMDEND_NO_Val << SDMMC_EISTR_CMDEND_Pos) /* (SDMMC_EISTR) No error Position  */
#define SDMMC_EISTR_CMDEND_YES                (SDMMC_EISTR_CMDEND_YES_Val << SDMMC_EISTR_CMDEND_Pos) /* (SDMMC_EISTR) End Bit Error Generated Position  */
#define SDMMC_EISTR_CMDIDX_Pos                _UINT16_(3)                                          /* (SDMMC_EISTR) Command Index Error Position */
#define SDMMC_EISTR_CMDIDX_Msk                (_UINT16_(0x1) << SDMMC_EISTR_CMDIDX_Pos)            /* (SDMMC_EISTR) Command Index Error Mask */
#define SDMMC_EISTR_CMDIDX(value)             (SDMMC_EISTR_CMDIDX_Msk & (_UINT16_(value) << SDMMC_EISTR_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDMMC_EISTR register */
#define   SDMMC_EISTR_CMDIDX_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_CMDIDX_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) Error  */
#define SDMMC_EISTR_CMDIDX_NO                 (SDMMC_EISTR_CMDIDX_NO_Val << SDMMC_EISTR_CMDIDX_Pos) /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_CMDIDX_YES                (SDMMC_EISTR_CMDIDX_YES_Val << SDMMC_EISTR_CMDIDX_Pos) /* (SDMMC_EISTR) Error Position  */
#define SDMMC_EISTR_DATTEO_Pos                _UINT16_(4)                                          /* (SDMMC_EISTR) Data Timeout Error Position */
#define SDMMC_EISTR_DATTEO_Msk                (_UINT16_(0x1) << SDMMC_EISTR_DATTEO_Pos)            /* (SDMMC_EISTR) Data Timeout Error Mask */
#define SDMMC_EISTR_DATTEO(value)             (SDMMC_EISTR_DATTEO_Msk & (_UINT16_(value) << SDMMC_EISTR_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDMMC_EISTR register */
#define   SDMMC_EISTR_DATTEO_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_DATTEO_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) Timeout  */
#define SDMMC_EISTR_DATTEO_NO                 (SDMMC_EISTR_DATTEO_NO_Val << SDMMC_EISTR_DATTEO_Pos) /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_DATTEO_YES                (SDMMC_EISTR_DATTEO_YES_Val << SDMMC_EISTR_DATTEO_Pos) /* (SDMMC_EISTR) Timeout Position  */
#define SDMMC_EISTR_DATCRC_Pos                _UINT16_(5)                                          /* (SDMMC_EISTR) Data CRC Error Position */
#define SDMMC_EISTR_DATCRC_Msk                (_UINT16_(0x1) << SDMMC_EISTR_DATCRC_Pos)            /* (SDMMC_EISTR) Data CRC Error Mask */
#define SDMMC_EISTR_DATCRC(value)             (SDMMC_EISTR_DATCRC_Msk & (_UINT16_(value) << SDMMC_EISTR_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDMMC_EISTR register */
#define   SDMMC_EISTR_DATCRC_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_DATCRC_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) Error  */
#define SDMMC_EISTR_DATCRC_NO                 (SDMMC_EISTR_DATCRC_NO_Val << SDMMC_EISTR_DATCRC_Pos) /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_DATCRC_YES                (SDMMC_EISTR_DATCRC_YES_Val << SDMMC_EISTR_DATCRC_Pos) /* (SDMMC_EISTR) Error Position  */
#define SDMMC_EISTR_DATEND_Pos                _UINT16_(6)                                          /* (SDMMC_EISTR) Data End Bit Error Position */
#define SDMMC_EISTR_DATEND_Msk                (_UINT16_(0x1) << SDMMC_EISTR_DATEND_Pos)            /* (SDMMC_EISTR) Data End Bit Error Mask */
#define SDMMC_EISTR_DATEND(value)             (SDMMC_EISTR_DATEND_Msk & (_UINT16_(value) << SDMMC_EISTR_DATEND_Pos)) /* Assigment of value for DATEND in the SDMMC_EISTR register */
#define   SDMMC_EISTR_DATEND_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_DATEND_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) Error  */
#define SDMMC_EISTR_DATEND_NO                 (SDMMC_EISTR_DATEND_NO_Val << SDMMC_EISTR_DATEND_Pos) /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_DATEND_YES                (SDMMC_EISTR_DATEND_YES_Val << SDMMC_EISTR_DATEND_Pos) /* (SDMMC_EISTR) Error Position  */
#define SDMMC_EISTR_CURLIM_Pos                _UINT16_(7)                                          /* (SDMMC_EISTR) Current Limit Error Position */
#define SDMMC_EISTR_CURLIM_Msk                (_UINT16_(0x1) << SDMMC_EISTR_CURLIM_Pos)            /* (SDMMC_EISTR) Current Limit Error Mask */
#define SDMMC_EISTR_CURLIM(value)             (SDMMC_EISTR_CURLIM_Msk & (_UINT16_(value) << SDMMC_EISTR_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDMMC_EISTR register */
#define   SDMMC_EISTR_CURLIM_NO_Val           _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_CURLIM_YES_Val          _UINT16_(0x1)                                        /* (SDMMC_EISTR) Power Fail  */
#define SDMMC_EISTR_CURLIM_NO                 (SDMMC_EISTR_CURLIM_NO_Val << SDMMC_EISTR_CURLIM_Pos) /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_CURLIM_YES                (SDMMC_EISTR_CURLIM_YES_Val << SDMMC_EISTR_CURLIM_Pos) /* (SDMMC_EISTR) Power Fail Position  */
#define SDMMC_EISTR_ACMD_Pos                  _UINT16_(8)                                          /* (SDMMC_EISTR) Auto CMD Error Position */
#define SDMMC_EISTR_ACMD_Msk                  (_UINT16_(0x1) << SDMMC_EISTR_ACMD_Pos)              /* (SDMMC_EISTR) Auto CMD Error Mask */
#define SDMMC_EISTR_ACMD(value)               (SDMMC_EISTR_ACMD_Msk & (_UINT16_(value) << SDMMC_EISTR_ACMD_Pos)) /* Assigment of value for ACMD in the SDMMC_EISTR register */
#define   SDMMC_EISTR_ACMD_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_ACMD_YES_Val            _UINT16_(0x1)                                        /* (SDMMC_EISTR) Error  */
#define SDMMC_EISTR_ACMD_NO                   (SDMMC_EISTR_ACMD_NO_Val << SDMMC_EISTR_ACMD_Pos)    /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_ACMD_YES                  (SDMMC_EISTR_ACMD_YES_Val << SDMMC_EISTR_ACMD_Pos)   /* (SDMMC_EISTR) Error Position  */
#define SDMMC_EISTR_ADMA_Pos                  _UINT16_(9)                                          /* (SDMMC_EISTR) ADMA Error Position */
#define SDMMC_EISTR_ADMA_Msk                  (_UINT16_(0x1) << SDMMC_EISTR_ADMA_Pos)              /* (SDMMC_EISTR) ADMA Error Mask */
#define SDMMC_EISTR_ADMA(value)               (SDMMC_EISTR_ADMA_Msk & (_UINT16_(value) << SDMMC_EISTR_ADMA_Pos)) /* Assigment of value for ADMA in the SDMMC_EISTR register */
#define   SDMMC_EISTR_ADMA_NO_Val             _UINT16_(0x0)                                        /* (SDMMC_EISTR) No Error  */
#define   SDMMC_EISTR_ADMA_YES_Val            _UINT16_(0x1)                                        /* (SDMMC_EISTR) Error  */
#define SDMMC_EISTR_ADMA_NO                   (SDMMC_EISTR_ADMA_NO_Val << SDMMC_EISTR_ADMA_Pos)    /* (SDMMC_EISTR) No Error Position  */
#define SDMMC_EISTR_ADMA_YES                  (SDMMC_EISTR_ADMA_YES_Val << SDMMC_EISTR_ADMA_Pos)   /* (SDMMC_EISTR) Error Position  */
#define SDMMC_EISTR_Msk                       _UINT16_(0x03FF)                                     /* (SDMMC_EISTR) Register Mask  */

/* EMMC mode */
#define SDMMC_EISTR_EMMC_BOOTAE_Pos           _UINT16_(12)                                         /* (SDMMC_EISTR) Boot Acknowledge Error Position */
#define SDMMC_EISTR_EMMC_BOOTAE_Msk           (_UINT16_(0x1) << SDMMC_EISTR_EMMC_BOOTAE_Pos)       /* (SDMMC_EISTR) Boot Acknowledge Error Mask */
#define SDMMC_EISTR_EMMC_BOOTAE(value)        (SDMMC_EISTR_EMMC_BOOTAE_Msk & (_UINT16_(value) << SDMMC_EISTR_EMMC_BOOTAE_Pos))
#define   SDMMC_EISTR_EMMC_BOOTAE_0_Val       _UINT16_(0x0)                                        /* (SDMMC_EISTR) FIFO contains at least one byte  */
#define   SDMMC_EISTR_EMMC_BOOTAE_1_Val       _UINT16_(0x1)                                        /* (SDMMC_EISTR) FIFO is empty  */
#define SDMMC_EISTR_EMMC_BOOTAE_0             (SDMMC_EISTR_EMMC_BOOTAE_0_Val << SDMMC_EISTR_EMMC_BOOTAE_Pos) /* (SDMMC_EISTR) FIFO contains at least one byte Position  */
#define SDMMC_EISTR_EMMC_BOOTAE_1             (SDMMC_EISTR_EMMC_BOOTAE_1_Val << SDMMC_EISTR_EMMC_BOOTAE_Pos) /* (SDMMC_EISTR) FIFO is empty Position  */
#define SDMMC_EISTR_EMMC_Msk                  _UINT16_(0x1000)                                      /* (SDMMC_EISTR_EMMC) Register Mask  */


