Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/sdmmc.h
/* -------- SDMMC_EISIER : (SDMMC Offset: 0x3A) (R/W 16) Error Interrupt Signal Enable -------- */
#define SDMMC_EISIER_RESETVALUE               _UINT16_(0x00)                                       /*  (SDMMC_EISIER) Error Interrupt Signal Enable  Reset Value */

#define SDMMC_EISIER_CMDTEO_Pos               _UINT16_(0)                                          /* (SDMMC_EISIER) Command Timeout Error Signal Enable Position */
#define SDMMC_EISIER_CMDTEO_Msk               (_UINT16_(0x1) << SDMMC_EISIER_CMDTEO_Pos)           /* (SDMMC_EISIER) Command Timeout Error Signal Enable Mask */
#define SDMMC_EISIER_CMDTEO(value)            (SDMMC_EISIER_CMDTEO_Msk & (_UINT16_(value) << SDMMC_EISIER_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDMMC_EISIER register */
#define   SDMMC_EISIER_CMDTEO_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_CMDTEO_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_CMDTEO_MASKED            (SDMMC_EISIER_CMDTEO_MASKED_Val << SDMMC_EISIER_CMDTEO_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_CMDTEO_ENABLED           (SDMMC_EISIER_CMDTEO_ENABLED_Val << SDMMC_EISIER_CMDTEO_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_CMDCRC_Pos               _UINT16_(1)                                          /* (SDMMC_EISIER) Command CRC Error Signal Enable Position */
#define SDMMC_EISIER_CMDCRC_Msk               (_UINT16_(0x1) << SDMMC_EISIER_CMDCRC_Pos)           /* (SDMMC_EISIER) Command CRC Error Signal Enable Mask */
#define SDMMC_EISIER_CMDCRC(value)            (SDMMC_EISIER_CMDCRC_Msk & (_UINT16_(value) << SDMMC_EISIER_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDMMC_EISIER register */
#define   SDMMC_EISIER_CMDCRC_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_CMDCRC_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_CMDCRC_MASKED            (SDMMC_EISIER_CMDCRC_MASKED_Val << SDMMC_EISIER_CMDCRC_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_CMDCRC_ENABLED           (SDMMC_EISIER_CMDCRC_ENABLED_Val << SDMMC_EISIER_CMDCRC_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_CMDEND_Pos               _UINT16_(2)                                          /* (SDMMC_EISIER) Command End Bit Error Signal Enable Position */
#define SDMMC_EISIER_CMDEND_Msk               (_UINT16_(0x1) << SDMMC_EISIER_CMDEND_Pos)           /* (SDMMC_EISIER) Command End Bit Error Signal Enable Mask */
#define SDMMC_EISIER_CMDEND(value)            (SDMMC_EISIER_CMDEND_Msk & (_UINT16_(value) << SDMMC_EISIER_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDMMC_EISIER register */
#define   SDMMC_EISIER_CMDEND_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_CMDEND_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_CMDEND_MASKED            (SDMMC_EISIER_CMDEND_MASKED_Val << SDMMC_EISIER_CMDEND_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_CMDEND_ENABLED           (SDMMC_EISIER_CMDEND_ENABLED_Val << SDMMC_EISIER_CMDEND_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_CMDIDX_Pos               _UINT16_(3)                                          /* (SDMMC_EISIER) Command Index Error Signal Enable Position */
#define SDMMC_EISIER_CMDIDX_Msk               (_UINT16_(0x1) << SDMMC_EISIER_CMDIDX_Pos)           /* (SDMMC_EISIER) Command Index Error Signal Enable Mask */
#define SDMMC_EISIER_CMDIDX(value)            (SDMMC_EISIER_CMDIDX_Msk & (_UINT16_(value) << SDMMC_EISIER_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDMMC_EISIER register */
#define   SDMMC_EISIER_CMDIDX_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_CMDIDX_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_CMDIDX_MASKED            (SDMMC_EISIER_CMDIDX_MASKED_Val << SDMMC_EISIER_CMDIDX_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_CMDIDX_ENABLED           (SDMMC_EISIER_CMDIDX_ENABLED_Val << SDMMC_EISIER_CMDIDX_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_DATTEO_Pos               _UINT16_(4)                                          /* (SDMMC_EISIER) Data Timeout Error Signal Enable Position */
#define SDMMC_EISIER_DATTEO_Msk               (_UINT16_(0x1) << SDMMC_EISIER_DATTEO_Pos)           /* (SDMMC_EISIER) Data Timeout Error Signal Enable Mask */
#define SDMMC_EISIER_DATTEO(value)            (SDMMC_EISIER_DATTEO_Msk & (_UINT16_(value) << SDMMC_EISIER_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDMMC_EISIER register */
#define   SDMMC_EISIER_DATTEO_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_DATTEO_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_DATTEO_MASKED            (SDMMC_EISIER_DATTEO_MASKED_Val << SDMMC_EISIER_DATTEO_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_DATTEO_ENABLED           (SDMMC_EISIER_DATTEO_ENABLED_Val << SDMMC_EISIER_DATTEO_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_DATCRC_Pos               _UINT16_(5)                                          /* (SDMMC_EISIER) Data CRC Error Signal Enable Position */
#define SDMMC_EISIER_DATCRC_Msk               (_UINT16_(0x1) << SDMMC_EISIER_DATCRC_Pos)           /* (SDMMC_EISIER) Data CRC Error Signal Enable Mask */
#define SDMMC_EISIER_DATCRC(value)            (SDMMC_EISIER_DATCRC_Msk & (_UINT16_(value) << SDMMC_EISIER_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDMMC_EISIER register */
#define   SDMMC_EISIER_DATCRC_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_DATCRC_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_DATCRC_MASKED            (SDMMC_EISIER_DATCRC_MASKED_Val << SDMMC_EISIER_DATCRC_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_DATCRC_ENABLED           (SDMMC_EISIER_DATCRC_ENABLED_Val << SDMMC_EISIER_DATCRC_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_DATEND_Pos               _UINT16_(6)                                          /* (SDMMC_EISIER) Data End Bit Error Signal Enable Position */
#define SDMMC_EISIER_DATEND_Msk               (_UINT16_(0x1) << SDMMC_EISIER_DATEND_Pos)           /* (SDMMC_EISIER) Data End Bit Error Signal Enable Mask */
#define SDMMC_EISIER_DATEND(value)            (SDMMC_EISIER_DATEND_Msk & (_UINT16_(value) << SDMMC_EISIER_DATEND_Pos)) /* Assigment of value for DATEND in the SDMMC_EISIER register */
#define   SDMMC_EISIER_DATEND_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_DATEND_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_DATEND_MASKED            (SDMMC_EISIER_DATEND_MASKED_Val << SDMMC_EISIER_DATEND_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_DATEND_ENABLED           (SDMMC_EISIER_DATEND_ENABLED_Val << SDMMC_EISIER_DATEND_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_CURLIM_Pos               _UINT16_(7)                                          /* (SDMMC_EISIER) Current Limit Error Signal Enable Position */
#define SDMMC_EISIER_CURLIM_Msk               (_UINT16_(0x1) << SDMMC_EISIER_CURLIM_Pos)           /* (SDMMC_EISIER) Current Limit Error Signal Enable Mask */
#define SDMMC_EISIER_CURLIM(value)            (SDMMC_EISIER_CURLIM_Msk & (_UINT16_(value) << SDMMC_EISIER_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDMMC_EISIER register */
#define   SDMMC_EISIER_CURLIM_MASKED_Val      _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_CURLIM_ENABLED_Val     _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_CURLIM_MASKED            (SDMMC_EISIER_CURLIM_MASKED_Val << SDMMC_EISIER_CURLIM_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_CURLIM_ENABLED           (SDMMC_EISIER_CURLIM_ENABLED_Val << SDMMC_EISIER_CURLIM_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_ACMD_Pos                 _UINT16_(8)                                          /* (SDMMC_EISIER) Auto CMD Error Signal Enable Position */
#define SDMMC_EISIER_ACMD_Msk                 (_UINT16_(0x1) << SDMMC_EISIER_ACMD_Pos)             /* (SDMMC_EISIER) Auto CMD Error Signal Enable Mask */
#define SDMMC_EISIER_ACMD(value)              (SDMMC_EISIER_ACMD_Msk & (_UINT16_(value) << SDMMC_EISIER_ACMD_Pos)) /* Assigment of value for ACMD in the SDMMC_EISIER register */
#define   SDMMC_EISIER_ACMD_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_ACMD_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_ACMD_MASKED              (SDMMC_EISIER_ACMD_MASKED_Val << SDMMC_EISIER_ACMD_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_ACMD_ENABLED             (SDMMC_EISIER_ACMD_ENABLED_Val << SDMMC_EISIER_ACMD_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_ADMA_Pos                 _UINT16_(9)                                          /* (SDMMC_EISIER) ADMA Error Signal Enable Position */
#define SDMMC_EISIER_ADMA_Msk                 (_UINT16_(0x1) << SDMMC_EISIER_ADMA_Pos)             /* (SDMMC_EISIER) ADMA Error Signal Enable Mask */
#define SDMMC_EISIER_ADMA(value)              (SDMMC_EISIER_ADMA_Msk & (_UINT16_(value) << SDMMC_EISIER_ADMA_Pos)) /* Assigment of value for ADMA in the SDMMC_EISIER register */
#define   SDMMC_EISIER_ADMA_MASKED_Val        _UINT16_(0x0)                                        /* (SDMMC_EISIER) Masked  */
#define   SDMMC_EISIER_ADMA_ENABLED_Val       _UINT16_(0x1)                                        /* (SDMMC_EISIER) Enabled  */
#define SDMMC_EISIER_ADMA_MASKED              (SDMMC_EISIER_ADMA_MASKED_Val << SDMMC_EISIER_ADMA_Pos) /* (SDMMC_EISIER) Masked Position  */
#define SDMMC_EISIER_ADMA_ENABLED             (SDMMC_EISIER_ADMA_ENABLED_Val << SDMMC_EISIER_ADMA_Pos) /* (SDMMC_EISIER) Enabled Position  */
#define SDMMC_EISIER_Msk                      _UINT16_(0x03FF)                                     /* (SDMMC_EISIER) Register Mask  */

/* EMMC mode */
#define SDMMC_EISIER_EMMC_BOOTAE_Pos          _UINT16_(12)                                         /* (SDMMC_EISIER) Boot Acknowledge Error Signal Enable Position */
#define SDMMC_EISIER_EMMC_BOOTAE_Msk          (_UINT16_(0x1) << SDMMC_EISIER_EMMC_BOOTAE_Pos)      /* (SDMMC_EISIER) Boot Acknowledge Error Signal Enable Mask */
#define SDMMC_EISIER_EMMC_BOOTAE(value)       (SDMMC_EISIER_EMMC_BOOTAE_Msk & (_UINT16_(value) << SDMMC_EISIER_EMMC_BOOTAE_Pos))
#define SDMMC_EISIER_EMMC_Msk                 _UINT16_(0x1000)                                      /* (SDMMC_EISIER_EMMC) Register Mask  */


