Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/sdmmc.h
#define SDMMC_FERACES_ACMD12NE_Pos            _UINT16_(0)                                          /* (SDMMC_FERACES) Force Event for Auto CMD12 Not Executed Position */
#define SDMMC_FERACES_ACMD12NE_Msk            (_UINT16_(0x1) << SDMMC_FERACES_ACMD12NE_Pos)        /* (SDMMC_FERACES) Force Event for Auto CMD12 Not Executed Mask */
#define SDMMC_FERACES_ACMD12NE(value)         (SDMMC_FERACES_ACMD12NE_Msk & (_UINT16_(value) << SDMMC_FERACES_ACMD12NE_Pos)) /* Assigment of value for ACMD12NE in the SDMMC_FERACES register */
#define   SDMMC_FERACES_ACMD12NE_NO_Val       _UINT16_(0x0)                                        /* (SDMMC_FERACES) No Interrupt  */
#define   SDMMC_FERACES_ACMD12NE_YES_Val      _UINT16_(0x1)                                        /* (SDMMC_FERACES) Interrupt is generated  */
#define SDMMC_FERACES_ACMD12NE_NO             (SDMMC_FERACES_ACMD12NE_NO_Val << SDMMC_FERACES_ACMD12NE_Pos) /* (SDMMC_FERACES) No Interrupt Position  */
#define SDMMC_FERACES_ACMD12NE_YES            (SDMMC_FERACES_ACMD12NE_YES_Val << SDMMC_FERACES_ACMD12NE_Pos) /* (SDMMC_FERACES) Interrupt is generated Position  */
#define SDMMC_FERACES_ACMDTEO_Pos             _UINT16_(1)                                          /* (SDMMC_FERACES) Force Event for Auto CMD Timeout Error Position */
#define SDMMC_FERACES_ACMDTEO_Msk             (_UINT16_(0x1) << SDMMC_FERACES_ACMDTEO_Pos)         /* (SDMMC_FERACES) Force Event for Auto CMD Timeout Error Mask */
#define SDMMC_FERACES_ACMDTEO(value)          (SDMMC_FERACES_ACMDTEO_Msk & (_UINT16_(value) << SDMMC_FERACES_ACMDTEO_Pos)) /* Assigment of value for ACMDTEO in the SDMMC_FERACES register */
#define   SDMMC_FERACES_ACMDTEO_NO_Val        _UINT16_(0x0)                                        /* (SDMMC_FERACES) No Interrupt  */
#define   SDMMC_FERACES_ACMDTEO_YES_Val       _UINT16_(0x1)                                        /* (SDMMC_FERACES) Interrupt is generated  */
#define SDMMC_FERACES_ACMDTEO_NO              (SDMMC_FERACES_ACMDTEO_NO_Val << SDMMC_FERACES_ACMDTEO_Pos) /* (SDMMC_FERACES) No Interrupt Position  */
#define SDMMC_FERACES_ACMDTEO_YES             (SDMMC_FERACES_ACMDTEO_YES_Val << SDMMC_FERACES_ACMDTEO_Pos) /* (SDMMC_FERACES) Interrupt is generated Position  */
#define SDMMC_FERACES_ACMDCRC_Pos             _UINT16_(2)                                          /* (SDMMC_FERACES) Force Event for Auto CMD CRC Error Position */
#define SDMMC_FERACES_ACMDCRC_Msk             (_UINT16_(0x1) << SDMMC_FERACES_ACMDCRC_Pos)         /* (SDMMC_FERACES) Force Event for Auto CMD CRC Error Mask */
#define SDMMC_FERACES_ACMDCRC(value)          (SDMMC_FERACES_ACMDCRC_Msk & (_UINT16_(value) << SDMMC_FERACES_ACMDCRC_Pos)) /* Assigment of value for ACMDCRC in the SDMMC_FERACES register */
#define   SDMMC_FERACES_ACMDCRC_NO_Val        _UINT16_(0x0)                                        /* (SDMMC_FERACES) No Interrupt  */
#define   SDMMC_FERACES_ACMDCRC_YES_Val       _UINT16_(0x1)                                        /* (SDMMC_FERACES) Interrupt is generated  */
#define SDMMC_FERACES_ACMDCRC_NO              (SDMMC_FERACES_ACMDCRC_NO_Val << SDMMC_FERACES_ACMDCRC_Pos) /* (SDMMC_FERACES) No Interrupt Position  */
#define SDMMC_FERACES_ACMDCRC_YES             (SDMMC_FERACES_ACMDCRC_YES_Val << SDMMC_FERACES_ACMDCRC_Pos) /* (SDMMC_FERACES) Interrupt is generated Position  */
#define SDMMC_FERACES_ACMDEND_Pos             _UINT16_(3)                                          /* (SDMMC_FERACES) Force Event for Auto CMD End Bit Error Position */
#define SDMMC_FERACES_ACMDEND_Msk             (_UINT16_(0x1) << SDMMC_FERACES_ACMDEND_Pos)         /* (SDMMC_FERACES) Force Event for Auto CMD End Bit Error Mask */
#define SDMMC_FERACES_ACMDEND(value)          (SDMMC_FERACES_ACMDEND_Msk & (_UINT16_(value) << SDMMC_FERACES_ACMDEND_Pos)) /* Assigment of value for ACMDEND in the SDMMC_FERACES register */
#define   SDMMC_FERACES_ACMDEND_NO_Val        _UINT16_(0x0)                                        /* (SDMMC_FERACES) No Interrupt  */
#define   SDMMC_FERACES_ACMDEND_YES_Val       _UINT16_(0x1)                                        /* (SDMMC_FERACES) Interrupt is generated  */
#define SDMMC_FERACES_ACMDEND_NO              (SDMMC_FERACES_ACMDEND_NO_Val << SDMMC_FERACES_ACMDEND_Pos) /* (SDMMC_FERACES) No Interrupt Position  */
#define SDMMC_FERACES_ACMDEND_YES             (SDMMC_FERACES_ACMDEND_YES_Val << SDMMC_FERACES_ACMDEND_Pos) /* (SDMMC_FERACES) Interrupt is generated Position  */
#define SDMMC_FERACES_ACMDIDX_Pos             _UINT16_(4)                                          /* (SDMMC_FERACES) Force Event for Auto CMD Index Error Position */
#define SDMMC_FERACES_ACMDIDX_Msk             (_UINT16_(0x1) << SDMMC_FERACES_ACMDIDX_Pos)         /* (SDMMC_FERACES) Force Event for Auto CMD Index Error Mask */
#define SDMMC_FERACES_ACMDIDX(value)          (SDMMC_FERACES_ACMDIDX_Msk & (_UINT16_(value) << SDMMC_FERACES_ACMDIDX_Pos)) /* Assigment of value for ACMDIDX in the SDMMC_FERACES register */
#define   SDMMC_FERACES_ACMDIDX_NO_Val        _UINT16_(0x0)                                        /* (SDMMC_FERACES) No Interrupt  */
#define   SDMMC_FERACES_ACMDIDX_YES_Val       _UINT16_(0x1)                                        /* (SDMMC_FERACES) Interrupt is generated  */
#define SDMMC_FERACES_ACMDIDX_NO              (SDMMC_FERACES_ACMDIDX_NO_Val << SDMMC_FERACES_ACMDIDX_Pos) /* (SDMMC_FERACES) No Interrupt Position  */
#define SDMMC_FERACES_ACMDIDX_YES             (SDMMC_FERACES_ACMDIDX_YES_Val << SDMMC_FERACES_ACMDIDX_Pos) /* (SDMMC_FERACES) Interrupt is generated Position  */
#define SDMMC_FERACES_CMDNI_Pos               _UINT16_(7)                                          /* (SDMMC_FERACES) Force Event for Command Not Issued By Auto CMD12 Error Position */
#define SDMMC_FERACES_CMDNI_Msk               (_UINT16_(0x1) << SDMMC_FERACES_CMDNI_Pos)           /* (SDMMC_FERACES) Force Event for Command Not Issued By Auto CMD12 Error Mask */
#define SDMMC_FERACES_CMDNI(value)            (SDMMC_FERACES_CMDNI_Msk & (_UINT16_(value) << SDMMC_FERACES_CMDNI_Pos)) /* Assigment of value for CMDNI in the SDMMC_FERACES register */
#define   SDMMC_FERACES_CMDNI_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FERACES) No Interrupt  */
#define   SDMMC_FERACES_CMDNI_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FERACES) Interrupt is generated  */
#define SDMMC_FERACES_CMDNI_NO                (SDMMC_FERACES_CMDNI_NO_Val << SDMMC_FERACES_CMDNI_Pos) /* (SDMMC_FERACES) No Interrupt Position  */
#define SDMMC_FERACES_CMDNI_YES               (SDMMC_FERACES_CMDNI_YES_Val << SDMMC_FERACES_CMDNI_Pos) /* (SDMMC_FERACES) Interrupt is generated Position  */
#define SDMMC_FERACES_Msk                     _UINT16_(0x009F)                                     /* (SDMMC_FERACES) Register Mask  */


/* -------- SDMMC_FEREIS : (SDMMC Offset: 0x52) ( /W 16) Force Event for Error Interrupt Status -------- */
#define SDMMC_FEREIS_RESETVALUE               _UINT16_(0x00)                                       /*  (SDMMC_FEREIS) Force Event for Error Interrupt Status  Reset Value */

#define SDMMC_FEREIS_CMDTEO_Pos               _UINT16_(0)                                          /* (SDMMC_FEREIS) Force Event for Command Timeout Error Position */
#define SDMMC_FEREIS_CMDTEO_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_CMDTEO_Pos)           /* (SDMMC_FEREIS) Force Event for Command Timeout Error Mask */
#define SDMMC_FEREIS_CMDTEO(value)            (SDMMC_FEREIS_CMDTEO_Msk & (_UINT16_(value) << SDMMC_FEREIS_CMDTEO_Pos)) /* Assigment of value for CMDTEO in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_CMDTEO_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_CMDTEO_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_CMDTEO_NO                (SDMMC_FEREIS_CMDTEO_NO_Val << SDMMC_FEREIS_CMDTEO_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_CMDTEO_YES               (SDMMC_FEREIS_CMDTEO_YES_Val << SDMMC_FEREIS_CMDTEO_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_CMDCRC_Pos               _UINT16_(1)                                          /* (SDMMC_FEREIS) Force Event for Command CRC Error Position */
#define SDMMC_FEREIS_CMDCRC_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_CMDCRC_Pos)           /* (SDMMC_FEREIS) Force Event for Command CRC Error Mask */
#define SDMMC_FEREIS_CMDCRC(value)            (SDMMC_FEREIS_CMDCRC_Msk & (_UINT16_(value) << SDMMC_FEREIS_CMDCRC_Pos)) /* Assigment of value for CMDCRC in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_CMDCRC_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_CMDCRC_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_CMDCRC_NO                (SDMMC_FEREIS_CMDCRC_NO_Val << SDMMC_FEREIS_CMDCRC_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_CMDCRC_YES               (SDMMC_FEREIS_CMDCRC_YES_Val << SDMMC_FEREIS_CMDCRC_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_CMDEND_Pos               _UINT16_(2)                                          /* (SDMMC_FEREIS) Force Event for Command End Bit Error Position */
#define SDMMC_FEREIS_CMDEND_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_CMDEND_Pos)           /* (SDMMC_FEREIS) Force Event for Command End Bit Error Mask */
#define SDMMC_FEREIS_CMDEND(value)            (SDMMC_FEREIS_CMDEND_Msk & (_UINT16_(value) << SDMMC_FEREIS_CMDEND_Pos)) /* Assigment of value for CMDEND in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_CMDEND_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_CMDEND_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_CMDEND_NO                (SDMMC_FEREIS_CMDEND_NO_Val << SDMMC_FEREIS_CMDEND_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_CMDEND_YES               (SDMMC_FEREIS_CMDEND_YES_Val << SDMMC_FEREIS_CMDEND_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_CMDIDX_Pos               _UINT16_(3)                                          /* (SDMMC_FEREIS) Force Event for Command Index Error Position */
#define SDMMC_FEREIS_CMDIDX_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_CMDIDX_Pos)           /* (SDMMC_FEREIS) Force Event for Command Index Error Mask */
#define SDMMC_FEREIS_CMDIDX(value)            (SDMMC_FEREIS_CMDIDX_Msk & (_UINT16_(value) << SDMMC_FEREIS_CMDIDX_Pos)) /* Assigment of value for CMDIDX in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_CMDIDX_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_CMDIDX_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_CMDIDX_NO                (SDMMC_FEREIS_CMDIDX_NO_Val << SDMMC_FEREIS_CMDIDX_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_CMDIDX_YES               (SDMMC_FEREIS_CMDIDX_YES_Val << SDMMC_FEREIS_CMDIDX_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_DATTEO_Pos               _UINT16_(4)                                          /* (SDMMC_FEREIS) Force Event for Data Timeout Error Position */
#define SDMMC_FEREIS_DATTEO_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_DATTEO_Pos)           /* (SDMMC_FEREIS) Force Event for Data Timeout Error Mask */
#define SDMMC_FEREIS_DATTEO(value)            (SDMMC_FEREIS_DATTEO_Msk & (_UINT16_(value) << SDMMC_FEREIS_DATTEO_Pos)) /* Assigment of value for DATTEO in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_DATTEO_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_DATTEO_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_DATTEO_NO                (SDMMC_FEREIS_DATTEO_NO_Val << SDMMC_FEREIS_DATTEO_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_DATTEO_YES               (SDMMC_FEREIS_DATTEO_YES_Val << SDMMC_FEREIS_DATTEO_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_DATCRC_Pos               _UINT16_(5)                                          /* (SDMMC_FEREIS) Force Event for Data CRC Error Position */
#define SDMMC_FEREIS_DATCRC_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_DATCRC_Pos)           /* (SDMMC_FEREIS) Force Event for Data CRC Error Mask */
#define SDMMC_FEREIS_DATCRC(value)            (SDMMC_FEREIS_DATCRC_Msk & (_UINT16_(value) << SDMMC_FEREIS_DATCRC_Pos)) /* Assigment of value for DATCRC in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_DATCRC_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_DATCRC_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_DATCRC_NO                (SDMMC_FEREIS_DATCRC_NO_Val << SDMMC_FEREIS_DATCRC_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_DATCRC_YES               (SDMMC_FEREIS_DATCRC_YES_Val << SDMMC_FEREIS_DATCRC_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_DATEND_Pos               _UINT16_(6)                                          /* (SDMMC_FEREIS) Force Event for Data End Bit Error Position */
#define SDMMC_FEREIS_DATEND_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_DATEND_Pos)           /* (SDMMC_FEREIS) Force Event for Data End Bit Error Mask */
#define SDMMC_FEREIS_DATEND(value)            (SDMMC_FEREIS_DATEND_Msk & (_UINT16_(value) << SDMMC_FEREIS_DATEND_Pos)) /* Assigment of value for DATEND in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_DATEND_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_DATEND_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_DATEND_NO                (SDMMC_FEREIS_DATEND_NO_Val << SDMMC_FEREIS_DATEND_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_DATEND_YES               (SDMMC_FEREIS_DATEND_YES_Val << SDMMC_FEREIS_DATEND_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_CURLIM_Pos               _UINT16_(7)                                          /* (SDMMC_FEREIS) Force Event for Current Limit Error Position */
#define SDMMC_FEREIS_CURLIM_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_CURLIM_Pos)           /* (SDMMC_FEREIS) Force Event for Current Limit Error Mask */
#define SDMMC_FEREIS_CURLIM(value)            (SDMMC_FEREIS_CURLIM_Msk & (_UINT16_(value) << SDMMC_FEREIS_CURLIM_Pos)) /* Assigment of value for CURLIM in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_CURLIM_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_CURLIM_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_CURLIM_NO                (SDMMC_FEREIS_CURLIM_NO_Val << SDMMC_FEREIS_CURLIM_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_CURLIM_YES               (SDMMC_FEREIS_CURLIM_YES_Val << SDMMC_FEREIS_CURLIM_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_ACMD_Pos                 _UINT16_(8)                                          /* (SDMMC_FEREIS) Force Event for Auto CMD Error Position */
#define SDMMC_FEREIS_ACMD_Msk                 (_UINT16_(0x1) << SDMMC_FEREIS_ACMD_Pos)             /* (SDMMC_FEREIS) Force Event for Auto CMD Error Mask */
#define SDMMC_FEREIS_ACMD(value)              (SDMMC_FEREIS_ACMD_Msk & (_UINT16_(value) << SDMMC_FEREIS_ACMD_Pos)) /* Assigment of value for ACMD in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_ACMD_NO_Val            _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_ACMD_YES_Val           _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_ACMD_NO                  (SDMMC_FEREIS_ACMD_NO_Val << SDMMC_FEREIS_ACMD_Pos)  /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_ACMD_YES                 (SDMMC_FEREIS_ACMD_YES_Val << SDMMC_FEREIS_ACMD_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_ADMA_Pos                 _UINT16_(9)                                          /* (SDMMC_FEREIS) Force Event for ADMA Error Position */
#define SDMMC_FEREIS_ADMA_Msk                 (_UINT16_(0x1) << SDMMC_FEREIS_ADMA_Pos)             /* (SDMMC_FEREIS) Force Event for ADMA Error Mask */
#define SDMMC_FEREIS_ADMA(value)              (SDMMC_FEREIS_ADMA_Msk & (_UINT16_(value) << SDMMC_FEREIS_ADMA_Pos)) /* Assigment of value for ADMA in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_ADMA_NO_Val            _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_ADMA_YES_Val           _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_ADMA_NO                  (SDMMC_FEREIS_ADMA_NO_Val << SDMMC_FEREIS_ADMA_Pos)  /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_ADMA_YES                 (SDMMC_FEREIS_ADMA_YES_Val << SDMMC_FEREIS_ADMA_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_BOOTAE_Pos               _UINT16_(12)                                         /* (SDMMC_FEREIS) Force Event for Boot Acknowledge Error Position */
#define SDMMC_FEREIS_BOOTAE_Msk               (_UINT16_(0x1) << SDMMC_FEREIS_BOOTAE_Pos)           /* (SDMMC_FEREIS) Force Event for Boot Acknowledge Error Mask */
#define SDMMC_FEREIS_BOOTAE(value)            (SDMMC_FEREIS_BOOTAE_Msk & (_UINT16_(value) << SDMMC_FEREIS_BOOTAE_Pos)) /* Assigment of value for BOOTAE in the SDMMC_FEREIS register */
#define   SDMMC_FEREIS_BOOTAE_NO_Val          _UINT16_(0x0)                                        /* (SDMMC_FEREIS) No Interrupt  */
#define   SDMMC_FEREIS_BOOTAE_YES_Val         _UINT16_(0x1)                                        /* (SDMMC_FEREIS) Interrupt is generated  */
#define SDMMC_FEREIS_BOOTAE_NO                (SDMMC_FEREIS_BOOTAE_NO_Val << SDMMC_FEREIS_BOOTAE_Pos) /* (SDMMC_FEREIS) No Interrupt Position  */
#define SDMMC_FEREIS_BOOTAE_YES               (SDMMC_FEREIS_BOOTAE_YES_Val << SDMMC_FEREIS_BOOTAE_Pos) /* (SDMMC_FEREIS) Interrupt is generated Position  */
#define SDMMC_FEREIS_Msk                      _UINT16_(0x13FF)                                     /* (SDMMC_FEREIS) Register Mask  */


